package com.support.android.designlibdemo.model;

import com.support.android.designlibdemo.R;

import java.util.Arrays;

public class FinalData {

    static Question o1q1 = new Question("Желите ли да сазнате да ли грешке младих возача имају заједничке особине?", "Доказано је да саобраћајне незгоде младих возача имају неке заједничке особине.");
    static Question o1q2 = new Question("Желите ли да сазнате разлику између ризичног понашања и несвесне вожње?", "Ризично понашање је намеран чин, док је непажљива вожња несвесна акција.");

    static CategoryObject o1 = new CategoryObject("Грешке младих возача", "•\tНепажљива вожња: мобилни телефони, музика, храна и смс поруке могу озбиљно да деконцентришу возаче. Непажљива вожња узрок је судара на путу у чак 80 одсто случајева.\n" +
            "•\tПревише ризична вожња: Активности као што су игнорисања саобраћајних знакова или престројавања без провере мртвих углова убрајају се у ''ризично понашање“. \n" +
            "•\tБрза вожња: Већина возача повремено вози брзо, али тинејџери то чине, јер олако схватају како брзина којом возе може да утиче на брзину њихове реакције. \n" +
            "•\tПревише особа у возилу: Млади људи врло често претрпавају своја возила, што често резултира агресивнијом вожњом и недостатком концентрације.\n" +
            "•\tВожња у алкохолизираном стању: Када млади људи пију и возе, мање је вероватно да ће бити у стању да се придржавати безбедносних правила.  \n" +
            "•\tОпасно приближавање другим возилима: Одржавање прописане удаљености измедју возила је један од битних услова за спречавању несрећа.\n" +
            "•\tВожња без појаса: Велики број младих возача не користи редовно појас, иако скоро сва нова возила имају уграђене аларме који возаче подсећају да морају да се вежу.\n" +
            "•\tНеспособност за адекватне реакције у хитним случајевима: Јер се само са искуством на путу може научити како да се избегне саобраћајна несрећа. Непредвиђених саобраћајних ситуација је огромни број и због тога се тешко могу научити у ауто школама. \n" +
            "•\tВожња у поспаном стању: Вожња у поспаном стању односи се на групу тзв. ''добре деце'', тј. одличних ученика са велики бројем ваншколских активности. \n" +
            "•\tПогрешан избор аута и лоше одржавање: Комбинација малог буџета и високог стила живота тера тинејџере да жртвују важне безбедносне елементе за јачи мотор и украсне делове. Уколико потроше читав буџет на куповину аутомобила, штедеће на његовом одржавању.\n" +
            "•\tКоришћење мобилних телефона током вожње: било за комуникацију, било за фотографисање.",R.drawable.cheese_1, Arrays.asList(o1q1, o1q2), "http://www.nesto.com");

    static Question o2q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o2q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o2 = new CategoryObject("Особине, личности и понашање", "Понашање возача се схвата као скуп одређених навика, склоности и емоционалних реакција приликом вожње, а укључује и евалуацију квалитета сопствене вожње. Понашање возача у саобраћају је врло сложено јер укључује реакције на већи број истовремених информација у ситуацијама које се стално мењају. Од квалитета и брзине реаговања возача зависиће његова безбедност и безбедност других учесника у саобраћају.\n" +
            "\n" +
            "Истраживања која су се бавила понашањем возача као издвојеним феноменом сугеришу да повезаност између особина личности и понашања возача постоји, и да природа те повезаности углавном подржава став да се људи приликом вожње понашају на сличан начин као и у другим ситуацијама. Као добри индикатори показали су се: \n" +
            "а) бес приликом вожње, \n" +
            "б) тражење сензација, \n" +
            "в) емоционална стабилност,\n" +
            "г) пријатност,\n" +
            "д) отвореност ка искуству.\n" +
            "\n" +
            "Отвореност је показала повезаност са ризичном вожњом, а пријатност са губљењем контроле над возилом, док је емоционална стабилност предвиђала агресивну вожњу. Тражење сензација се показало као добар индикатор низа карактеристика, као што су ризична неагресивна вожња, агресивна вожња, губљење концентрације при вожњи, мање незгоде и озбиљније несреће у саобраћају.",R.drawable.cheese_1, Arrays.asList(o2q1, o2q2), "http://www.nesto.com");

    static CategoryObject o3 = new CategoryObject("Нова категоризација", "АМ \tМопеди, лаки трицикли или четвороцикли. Право полагања са 16 година старости.\n" +
            "А-1 \tМотоцикли запремине до 125 кубних центиметара и тешки трицикли снаге мотора \tдо 15 кW. \tПраво полагања са 16 година.\n" +
            "А-2 \tМотоцикли снаге мотора до 35 кW. Право полагања са 18 година.\n" +
            "А \tМотицикли и тешки трицикли снаге мотора веће од 35 кW. Право полагања са 24 \tгодине.\n" +
            "B-1 \tТешки четвороцикли. Право полагања са 18 година. \n" +
            "B \tМоторна возила масе до 3 500 кг и до 8 седишта. Право полагања са 18 \tгодина. \n" +
            "BЕ \tВозила чије вучно возило припада категорији Б, а маса прикључног возила је од \t750 до 3500 кг. Право полагања са 18 година. \n" +
            "C-1 \tМоторна возила чија је највећа дозвољена маса од 3 500 до 7 500 кг. Право \tполагања са 18 година. \n" +
            "C-1Е \tВозила чије вучно возило спада у категорије Ц или C-1, а највећа дозвољена \tмаса \tприкључног возила прелази 750 кг. Право полагања са 18 година. \n" +
            "C\tМоторна возила осим категорија А, А-1, А-2, АМ, F, М, B, односно возила чија \tнајвећа \tдозвољена маса прелази 3 500 кг. Возилу може да се дода \tприколица чија маса не прелази 750 кг. \n" +
            "D-1\tМоторна возила са 8 до 16 седишта, и чија дужина не прелази 8м. Право \tполагања са 21 годином. \n" +
            "D-1Е\tВозила чије вучно возило припада категорији D-1, а маса прикључног возила је \tвећа од 750 \tкг. Право полагања са 21 годином. \n" +
            "D\tМоторна возила за превоз људи, која осим седишта возача имају више од осам \tседишта. \tПраво полагања са 24 године. \n" +
            "DЕ\tВозила чије вучно возило припада категорији D, а маса прикључног возила је \tвећа од 750 \tкг. Право полагања 24 године.\n" +
            "F\tТрактори са или без прикључних возила и радне машине.",R.drawable.cheese_1, Arrays.asList(o1q1, o1q2), "http://www.nesto.com");
//    static CategoryObject o4 = new CategoryObject(R.drawable.cheese_4, R.drawable.cheese_4, "Budjavi sir", "desc");
//    static CategoryObject o5 = new CategoryObject(0, R.drawable.cheese_5, "Mocarela", "To je jedan opak sir");

    static Category oneCat1 = new Category("За младе возаче","За младе возаче" ,"desc", Arrays.asList(o1, o2, o3), Arrays.asList(o1q1, o1q2), null);


    static Question o4q1 = new Question("Желите да сазнате који су стадијуми алкохолизма? ", "Има их шест и иду од стања пролазне опијености до коматозног стања.");
    static Question o4q2 = new Question("Желите да сазнате на које све органе делује алкохол?", "Он првенствено делује на мозак, десни, плућа, руке, јетру, ноге, изазива болове у стомаку, бубрезима, желуцу, срцу итд.");
    static CategoryObject o4 = new CategoryObject("Утицај алкохола" ,"Алкохол се сматра једним од највећих узрочника саобраћајних незгода, јер већ код малих количина од 0,02‰ слаби способност вожње, чиме се од количине алкохола у организму ствара директна зависност на способност управљања возилом.  Повећана концентрација алкохола од 0,6 до 1,5‰ даје видљиве знаке лаког пијанства, који углавном зависе од индивидуалних способности, док је преко ове концентрације пијанство лако уочљиво. Концентрација преко 3,5‰ доводи до бесвесног стања, а концентрација од 5 до 8‰ до смрти.\n" +
            "\n" +
            "Возач употребом алкохола оштећује оне функције које су најпотребније, односно оне које долазе до изражаја у одређеној критичној ситуацји, када је потребно да се реагује брзо. Узимањем алкохола смањује се расуђивање, способности, критичност, као и емоције. Најизраженији ефекти алкохола испољавају се читавим низом поремећаја у области опажања, реаговања и других психичких функција. Доказано је да возачка способност возача под утицајем алкохола од 0,02‰, опада прогресивно све до 1,4 а понекад и до 1,7‰, када се сматра да су возачи практично неспособни за вожњу.\n" +
            "\n" +
            "Уживаоци алкохола често нису свесни штетних последица уботребе алкохола за време и пре вожње, па зато питању њиховог васпитања и развијања свести превентивним радом треба посветити велику пажњу. Игноришу се чињенице о томе да:\n" +
            "1. Реакционо време или психичка секунда – јесте време реаговања од момента кад се испред визила појави извесна препрека па до момента када возач реагује на ту препреку, односно до момента притиска на кочницу.\n" +
            "2. У вожњи при брзини од 50 км/х у мраку, пошто возача засени, а затим аблендује возило које му долази у сусрет, трезном возачу је потребно 68 м да се привикне на новонасталу ситуацију, док је пијаном потребно 126м.\n" +
            "3. При брзини од 50 км/х возач ће при дневној светлости да распозна саобраћајни знак у трезном стању на 138м, као пијан распознаће тај знак на 112м, а као мамуран на 100.\n" +
            "\n" +
            "И најмање количине алкохола угрожавају безбедност саобраћаја, јер алкохол деградира све способности возача, без обзира на искуство. Најважније је да сваки човек промени свој став према свом понашању у саобраћају. Ако је човек пијан, онда је једино исправно да не вози у таквом стању. ",R.drawable.cheese_1, Arrays.asList(o4q1, o4q2), "http://www.nesto.com");

   static Question o5q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
   static Question o5q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o5 = new CategoryObject("Психичка секунда", "Pod psihičkom sekundom ili reakcijskim vremenom podrazumeva se vreme koje protekne od momenta percipiranja do momenta sprovođenja u delo određenih radnji, odnosno vreme koje protekne od uočavanja neke opasnosti ili prepreke pa do momenta preduzimanja određenih mera ili radnji da se ta opasnost otkloni. Reakcijsko vreme zavisi od sposobnosti pravilne percepcije i dobre koordinacije psihomotornog i muskulomotornog aparata. \n" +
            "\n" +
            "Psihička sekunda nije ista ni kod svih psihički zadravih osoba ali se smatra da je prosečana 0,75 sekundi. Iako je razlika od 0,75 sekundi prosečnog reakcijskog vremena i reakcijskog vremena od 1 sekunde vrlo mala, ona može dati veliku razliku u vožnji. \n" +
            "\n" +
            "Dejstvo alkohola se više ogleda u smanjenju tačnosti i preciznosti pri izvođenju određenih pokreta nego u produžetku vremena izvođenja. Naročito brzo dolazi do produženja psihičke sekunde ako se alkohol konzumira u toku psihičkog ili fizičkog umora. Dobro voziti ne znači samo poznavati propise i imati brže reflekse, nego se znati i ponašati u saobraćaju. Za razliku od treznih i zdravih vozača, alkoholisani vozači i sa najmanjim koncentracijama alkohola ugrožavaju bezbednost saobraćaja. Naročito je noćna vožnja uz alkohol znatno zamornija i potencijalno opasnija, pa su udesi noću češći zbog slabe vidljivosti, zaslepljenosti i veće pospanosti vozača. \n",R.drawable.cheese_1, null, "http://www.nesto.com");

    static Question o6q1 = new Question("Желите да сазнате колико је особа потребно за извлачење особе из возила у поступку пружања прве помоћи? ", "За извлачење повређеног из возила потребне су најмање три особе које морају радити уз највећи могући опрез. ");
    static Question o6q2 = new Question("Желите да сазнате колики је нормалан ритам дисања?", "Нормалан ритам дисања је 12 до 16 пута у минути.");
    static CategoryObject o6 = new CategoryObject("Прва помоћ", "Под првом помоћи подразумијева се помоћ коју унесрећенима на месту незгоде пружају особе које се ту затекну. Најчешће то нису здравствени радници јер се време и место потребе пружања прве помоћи не може предвидети. \n" +
            "\n" +
            "Пружање прве помоћи дело је људске солидарности и хуманости, али пре свега је то и морална обавеза сваког члана нашег друштва. Ова обавеза је утврђена и законским прописом којим је сваки грађанин дужан указати, према својој могућности, другоме прву помоћ, а ако је другој особи живот у опасности, дужан је о томе обавестити најближу здравствену установу или здравственог радника. \n" +
            "\n" +
            "Пружање прве помоћи почиње самим доласком на место удеса и мора бити организовано по одређеном реду хитности и то: \n" +
            "а) оријентациони преглед у возилу; \n" +
            "б) поступак с повређенима у граду и изван насеља; \n" +
            "в) извлачење повређених особа из возила; \n" +
            "г) преглед повређених особа након извлаĉења из возила; \n" +
            "д) стање привидне смрти и сигурна смрт; \n" +
            "ђ) поступак с одећом повређенога. \n" +
            "\n" +
            "Оријентациони преглед у возилу на месту саобраћајне несреће неопходно је што пре обавити Прво се проверава да ли је особа при свести како би се од ње добили подаци о евентуалној повреди. \n" +
            "Ако се током прегледа код повређене особе уочи јако крварење, неопходно га је одмах зауставити. \n" +
            "Ако је повређени без свести, потребно му је одмах осигурати проходност дисајних путева и положити га у бочни положај. \n" +
            "Ако повређени не дише и не ради му срце, мора се одмах приступити оживљавању. \n" +
            "\n" +
            "Ови поступци представљају \"неодгодиву прву помоћ\" тј. скуп поступака који се морају \"одмах\" применити јер њихов изостанак представља директну опасност по живот.\n" +
            "\n" +
            "Након што је оријентационим прегледом искључено евентуално крварење, губитак свести или престанак дисања и рада срца, преглед се неопходно наставља без хитности. Уколико је повређени без свести, преглед је отежан и ваља пажљиво прегледати цело тело. \n" +
            "\n" +
            "У циљу оцене општег стања организма, неопходно је утврдити, односно подузети следеће: \n" +
            "а) покушати комуницирати с особом постављањем једноставних питања и иствремено је лагано штипати за кожу на руци чиме се утврђује присутност или одсутност свести; \n" +
            "б) проверити рад срца пипањем жиле куцавице на врату, јагодицама прстију, у удубини између гркљана и великог вратног мишића, у висини Адамове јабучице; \n" +
            "в) проверити дисање стављањем образа испред уста и носа унесрећенога, те проматрањем грудног коша; \n" +
            "г) прегледом се мора установити је ли повређена особа мртва или није.",R.drawable.cheese_1, Arrays.asList(o6q1, o6q2), "http://www.nesto.com");

    static Question o7q1 = new Question("Желите да сазнате какви поремећаји настају употребом алкохола? ", "Сви поремећаји који настају под дејством алкохола на организам могу сврстати у три основне групе:\t а) поремећај структуре личности, \n" +
            "\t б) поремећај перцепције и психомоторике,\n" +
            "\t в) поремећај функције чулних органа.  ");
    static Question o7q2 = new Question("Желите да сазнате шта је сомоскривљена неурачунљивост и како је третира наш закон?", "Самоскривљена неурачунљивост, је посебан институт материјалног кривичног права и означава радњу слободну у одлуци, али неслободну у учињењу, те представља изузетак од правила непостојања кривичне одговорности због недостатка елемента урачунљивости. ");
    static CategoryObject o7 = new CategoryObject("Кривична одговорност за конзумирање алкохола", "Употреба омамљујућих средстава, алкохола и наркотика, други је по бројности узрочник саобраћајних несрећа, одмах иза неприлагођене брзине. У савременом законодавству, борба против алкохоличарског криминалитета је пооштрена применом казни, или и путем мера безбедности.\n" +
            "\n" +
            "Правилно је да учинитељ није кривично одговоран ако је у време предузимања радње учињења кривичног дела био неурачунљив. Од тог правила постоји изузетак када се учинитељ сам стави у стање неурачунљивости па учини кривично дело. У таквом случају учинитељ је одговоран, иако је дело учинио у неурачунљивом стању, под условом да се сам ставио у такво стање употребом алкохола, опојних дрога или на други начин, ако је у време довођења у такво стање његово дело било обухваћено умишљајем или нехатом. Тај изузетак се у кривичноправној теорији и пракси назива самоскривљена неурачунљивост.\n" +
            "\n" +
            "У вези са кривичним делима против сигурности јавног саобраћаја, битно је нагласити да наш закон прописује кривичну одговорност, како за умишљено почињење кривичног дела, тако и за нехатно, јер постоји последица на бази проузроковања. Самоскривљена неурачунљивост у кривичним делима угрожавања јавног саобраћаја због омамљености прописано је као посебан облик кривичног дела угрожавања јавног саобраћаја. Његово издвајање у посебно кривично дело указује на повећан број учесника у саобраћају под дејством алкохола и омамљујућих средстава, као и на повећан број саобраћајних несрећа под њиховим утицајем, што представља радњу кривичног дела.\n" +
            "\n" +
            "У погледу кривичне одговорности учинитељи кривичних дела угрожавања јавног саобраћаја почињених услед дејства омамљујућих средстава изједначавају се са урачунљивим извршиоцем кривичног дела, не само када су у вријеме извршења тих кривичних дела били неурачунљиви, него и када су били у стању битно смањене урачунљивости, јер логичко тумачење законских одредби упућује на то да се и према таквим учинитељима, у тим ситуацијама, треба односити као према потпуно урачунљивим учиниоцима кривичног дела.",R.drawable.cheese_1, Arrays.asList(o7q1, o7q2), "http://www.nesto.com");

    static Question o8q1 = new Question("Желите да сазнате како алкохол утиче на чула возача? ", "Рецимо, Трезан возач види саобраћајни знак на 140 метара удаљености, док алкохолисан на свега 118 метара. ");
    static Question o8q2 = new Question("Желите да сазнате да ли је пиво шкодљиво?", "Погрешно је мишљење да пиво није шкодљиво. Пиво поред концентрације алкохола од 6% има и благ успављујући ефекат.");
    static CategoryObject o8 = new CategoryObject("Алкохолисани возачи", "За разлику од трезних и здравих возача, алкохолисани возачи својим начином вожње ометају безбедно одвијање саобраћаја. Нарочито је ноћна вожња уз алкохол знатно заморнија и потенцијално опаснија, па су удеси ноћу чешћи због слабе видљивости, заслепљености и веће поспаности возача. Припити возачи:\n" +
            "- су некритични, самоуверени, лакомислени\n" +
            "- прецењују своје способности\n" +
            "- потцењују опасност\n" +
            "- возе пребрзо\n" +
            "- улазе у \"маказе\"\n" +
            "- прелазе пуне линије\n" +
            "- непрописно претичу\n" +
            "- секу кривине\n" +
            "- не поштују права првенства\n" +
            "- желе да се истичу у вожњи\n" +
            "- касније запажају \"стоп светло\"\n" +
            "- слабо процењују растојање између возила\n" +
            "- касније реагују на светлосне и звучне сигнале\n" +
            "- теже распознају црвену и зелену боју\n" +
            "- теже распознају сметње при вожњи ноћу и у сумраку\n" +
            "- често уместо кочнице притисну педалу гаса или обратно\n" +
            "\n" +
            "У складу са одребама Закона о безбедности саобраћаја на путевима у нашој пракси присутне су две методе за утврђивање алкохолисаности учесника у саобраћају и то: \n" +
            "а) анализа узетих узорака крви и урина од особе, која се обавља у специјализованој лабораторији, уз примену свих до сада признатих сведских стандарда,  \n" +
            "б) анализом издахнутог ваздуха из пића путем за то одговарајућих средстава алкотестова која се обавља на лицу места.",R.drawable.cheese_1, Arrays.asList(o8q1, o8q2), "http://www.nesto.com");

    static Question o9q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o9q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o9 = new CategoryObject("Алкометар", "Конзумирање алкохолних пића неповољно утиче на возачку способност и битно смањује безбедност у саобраћају. Најтеже несреће по броју жртава и по причињеној материјалној штети проузрокују возачи у алкохолисаном стању. Возач под дејством алкохола не сме да управља возилом у саобраћају на путу, ако је утврдјено да му садржина алкохола у крви прелази прописану границу или ако показује знаке поремећености. Такође и узимање мање количине алкохола уз психоактивне лекове или дрогу појачава опијеност.\n" +
            "\n" +
            "Колико траје трежњење?\n" +
            "а) Проценат до 0,8 промила и до 8 сати\n" +
            "б) Проценат до 1,3 промила око 13 сати\n" +
            "в) Проценат до 2,0 промила око 20 сати",R.drawable.cheese_1, null, "http://www.nesto.com");

    static Category oneCat2 = new Category("Безбедно понашање","Безбедно понашање", "desc", Arrays.asList(o4,o5,o6,o7,o8,o9), Arrays.asList(o4q1, o4q2,o6q1,o6q2,o7q1,o7q2,o8q1), null);

    static Sign s1 = new Sign("Знакови опасности", Arrays.asList(R.drawable.cheese_1, R.drawable.cheese_2), Arrays.asList("Prvi znak", "Drugi znak"));
    static Sign s2 = new Sign("Знакови опасности", Arrays.asList(R.drawable.cheese_1, R.drawable.cheese_2), Arrays.asList("Prvi znak", "Drugi znak"));

    static CategoryObject z1 = new CategoryObject("Знакови опасности", null, 0, null, null, s1);
    static CategoryObject z2 = new CategoryObject("Знакови изричитих наредби", null, 0, null, null, s2);

    static Category oneCat3 = new Category("Знакови","Знакови" ,"desc", Arrays.asList(z1, z2), null, null);

    static Category oneCat4 = new Category("Упитник", "Упитник","desc", Arrays.asList(o2, o3), Arrays.asList(o1q1, o1q2), null);

    public static final CategoryContainer one = new CategoryContainer("Mladi u saobracaju", Arrays.asList(oneCat1, oneCat2, oneCat3, oneCat4));

    static Question o10q1 = new Question("Желите да сазнате да ли је тело човека који лежи на путу препрека у смислу Закона о безбедности саобраћаја на путевима Републике Србије, или је пак то пешак?", "Ако се равнамо по дефиницији из Закона о безбедности саобраћаја на путевима Републике Србије, пешак је учесник у саобраћају, што представља релативно нову доктрину и правну претпоставку кривичног законодавства, јер је  његов положај у односу на друге учеснике у јавном саобраћају постао привилегован.");
    static Question o10q2 = new Question("Желите да сазнате да ли је човек који лежи на путу као учесник у саобраћају угрозио сигурност осталих учесника у јавном саобраћају?", "Таква могућност објективно постоји, с обзиром да је пешак сасвим равноправан учесник у јавном саобраћају, па тако нема ни право на некажњиву привилегију да спава на путу и тако угрожава безбедност јавног саобраћаја, стварајући опасност за друге, а и за себе.");
    static Category twoCat1 = new Category("Кривичноправна одговорност", "Кривична одговорност","Према одредбама Закона о основама безбедности саобраћаја на путевима, пешак је лице које учествује у саобраћају а не управља возилом, нити се превози у возилу или на возилу, лице које сопственом снагом гура или вуче ручна колица, запрежно возило или возило на моторни погон, дечије превозно средство, бицикл, бицикл са мотором или покретна колица за немоћна лица, као и лице у покретној столици за немоћна лица која покреће сопственом снагом или снагом мотора ако се, при том креће брзином човечијег хода, као и лице које клизи клизаљкама, скијама, санкама или се вози на котураљкама. Истим законским прописом, предвиђено је да је возач лице које на путу управља возилом, а возило је свако превозно средство намењено за кретање по путу, осим покретних столица без мотора за немоћна лица и дечјих превозних средстава. Као учесници у јавном саобраћају, пешаци имају значајан удео.\n" +
            "\n" +
            "Медју најчешће евидентиране грешке пешака, убрајају се: \n" +
            "а) прелажење коловоза ван обележеног пешачког прелаза, \n" +
            "б) изненадно прелажење коловоза иза заустављеног возила, \n" +
            "в) прелажење коловоза на црвеном светлу семафора, \n" +
            "г) неправилно задржавање и играње на коловозу, итд.\n" +
            "Најчешће евидентиране грешке возача догађају се: \n" +
            "а) на пешачком прелазу, \n" +
            "б) ван пешачког прелаза, \n" +
            "в) на тротоару, \n" +
            "д) аутобуском стајалишту, итд.\n" +
            "\n" +
            "Пешак је најслабији учесник у конфликтној ситуацији. За његово учешће не постоје правне норме о саобраћајном образовању и васпитању, узрасту и психофизичким способностима, за разлику од возача моторних возила. Због тога, он је најугроженији, чест учесник у саобаћајним незгодама и најчешће жртва саобраћајне незгоде.\n" +
            "\n" +
            "Овој категорији учесника у саобраћају треба дати приоритет код планирања и уређења саобраћајних површина, у правној регулативи односа према другим категоријама учесника у саобраћају, у планирању и реализацији образовних, васпитних и пропагандних садржаја.", null, Arrays.asList(o10q1, o10q2), null);



    static CategoryObject o11 = new CategoryObject("Казне за алкохолисане возаче", "Граница толеранције 0,3 промила алкохола у крви.\n" +
            "- Благо пијанство: 0,3 промила алкохола у крви\n" +
            "- Умерено пијанство: 0,31-0,5 промила. Запрећена казна за овај прекршај је новчана казна од 5000 динара. Возач се искључује из саобраћаја. \n" +
            "- Средње пијанство: 0,51-1,19 промила. Против возача се покреће прекршајни поступак. Запрећена новчана казна је од 6000 до 20 000 динара, шест казнених поена. Возач се искључује из саобраћаја. \n" +
            "- Тешко пијанство: 1,20-1,60 промила. Прекршајни поступак, а новчана казна је између 15 000 и 30 000 динара. Возач добија 10 казнених поена, уз задржавање у полицијској станици најмање 12 часова. \n" +
            "- Веома тешко пијанство: 1,61-2,00 промила. Запрећена новчана казна је од 15 000 до 30 000 динара, а уз добијање 12 казнених поена обавезно је задржавање возача у полицијској станици најмање 12 часова.\n" +
            "- Потпуно пијанство: Више од 2,00 промила. Подразумева се обавезно изрицање законске казне од 15 дана, 14 казнених поена и обавезно задржавање возача у полицијској станици, највише 12 часова. \n" +
            "- Пешаци који су под утицајем алкохола или психоактивних супстанци, у случају одбијања тестирања или подвргавања стручном прегледу у здравственој установи, лице ће се казнити новчано од 15 000 до 30 000 динара, или са затвором до 30 дана.\n",R.drawable.cheese_1, null, "http://www.nesto.com");
    static CategoryObject o12 = new CategoryObject("Новчане казне", "Kazne od 3000 dinara:\n" +
            "- Za neuključivanje svetala danju\n" +
            "- Za zauzimanje više od jednog parking mesta\n" +
            "- Za vozače motocikala, mopeda i tricikla koji na oba uha koriste slušalice audio \tuređaja. \n" +
            "- Za neomogućavanje slobodnog prostora za prolaz vozila pod pratnjom ili sa \tpravom prvenstva. \n" +
            "- Za vožnju bicikla bez obe ruke na volanu, ili u slučaju da ga vuče, ili se \tpridržava za drugo vozilo. \n" +
            "- Za nenošenje vozačke, saobraćajne ili probne dozvole. \n" +
            "- Za neuključivanje sva četiri žmigavca prilikom zaustavljanja na kolovozu, za \tvreme ulaska ili izlaska putnika, odnosno u slučaju opasnosti na putu. \n" +
            "- Za neposedovanje belog svetla napred i crvenog pozadi na biciklu. \n" +
            "- Za izvođače radova na putu koji nemaju odgovarajući svetleći prsluk. \n" +
            "- Za pešake koji se na kolovozu van naselja ne kreću bliže levoj ivici kolovoza u \tsmeru kretanja vozila, kao i u slučaju nekorišćenja trotoara. \n" +
            "Kazne od 5000 dinara:\n" +
            "- Za vozače i putnike koji ne koriste sigurnosne pojaseve\n" +
            "- Za vozače koji koriste mobilni telefon tokom vožnje bez upotrebe „hands free“ \tuređaja ili Bluetooth slušalica\n" +
            "- Za vozače koji naglo menjaju način vožnje i skreću bez uključivanja žmigavca\n" +
            "- Za vozače koji ne poštuju propisano rastojanje od drugih vozila, odnosno \tučesnika u saobraćaju\n" +
            "- Za vozače bicikla koji ne voze desnom stranom na biciklističkoj stazi u oba \tsmera, ili ako se dva ili više vozača bicikla (isto kao i mopeda, tricikala ili \tmotocikala) kreću u grupi a ne koloni\n" +
            "- Za pešake koji stupe na kolovoz, ili se ne sklone da omoguće prolaz vozilima sa \tpravom prvenstva. \n" +
            "- Za pešake koji prelaze pešački prelaz za vreme trajanja crvenog svetla \tnasemaforu. \n" +
            "- Za vozače koji mesto zaustavljanja vozila ne obeleže sigurnosnim trouglom, \todnosno ne postave ga propisano, 50 m od vozila (van naselja), najmanje 10 m \t(u naselju), i koji za vreme stajanja ne uključe sva četiri žmigavca. Obavezan je \ti fluorescentni prsluk. \n" +
            "- Za vozače koji noću koriste kratka svetla\n" +
            "- Za sporu vožnju koja ometa saobraćaj\n" +
            "- Za vozače koji se kreću unazad na nepreglednom delu puta, pri smanjenoj \tvidljivosti, u tunelu, na mestima gde je zabranjeno zaustavljanje ili preko \tpruge. \n" +
            "- Za vozače koji skreću udesno, a ne kreću se krajnjom desnom stranom i ne \tpropuštaju vozila koja se kreću desnom stranom. \n" +
            "- Za zaustavljanje odnosno parkiranje vozila na pešačkom prelazu, prelazu preko \tželezničke pruge, raskrsnici, stajalištu za vozila javnog prevoza, u slučaju \tzaklanjanja saobraćajnog znaka, kao i za parkiranje na mestu rezervisanom sa \tosobe sa invaliditetom. \n" +
            "- Za vozače koji se kreću zaustavnom trakom\n" +
            "- Za nepropuštanje pešaka koji su krenuli da prelaze ulicu\n" +
            "Kazne od 6000 do 20 000 dinara:\n" +
            "- Za vozača koji se kreće pešačkom zonom, ili delom puta predviđenim isključivo \tza pešake\n" +
            "- Za vozača koji pretiče kolonu vozila\n" +
            "- Za vozača koji je započeo preticanje a vozač iza njega je već počeo da pretiče\n" +
            "- Za vozača koji pretiče zaustavnom trakom\n" +
            "- Za vozača koji se kreće unazad na autoputu ili putu za motorna vozila\n" +
            "- Za vozača koji povećava brzinu dok ga pretiče drugo vozilo\n" +
            "- Za vozača kome je istekao rok važenja vozačke dozvole do šest meseci\n" +
            "- Za vozača koji pretiče ispred raskrsnice ili na raskrsnici koja nije kružni tok\n" +
            "- Za vozača koji upravlja vozilom sa neispravnim kočnicama, upravljačkim \tsistemom ili pneumaticima \n" +
            "- Za vozača koji ne poštuje pravo prvenstva prolaza odnosno pravilo desne strane\n" +
            "- Za vozača koji ne propusti sva vozila koja se kreću putem na koji se uključuje\n" +
            "- Za vozača koji preseca biciklističku stazu, a ne propušta vozila koja se njome \tkreću\n" +
            "- Za vozača koji ne obeleži sigurnosnim trouglom vozilo koje je zaustavljeno na \tkolovozu\n" +
            "- Za vozača čije je vozilo opremljeno gasnim uređajem bez atesta\n" +
            "- Za vozača koji vozi suprotnim smerom od smera kretanja\n",R.drawable.cheese_1, null, "http://www.nesto.com");
    static CategoryObject o13 = new CategoryObject("Казнени поени и висина новчаних казни за поједине прекршаје", "2 казнена поена (новчана казна од 6000 до 30 000 динара)\n" +
            "- Вожња са дозволом која је истекла пре мање од 6 месеци\n" +
            "- Превоз путника у простору који се не може отворити изнутра\n" +
            "- Полукружно окретање у тунелу, на мосту, вијадукту, подвожњаку, надвожњаку, у условима \tсмањене видљивости. \n" +
            "- Вожња зими без неодговарајуће опреме. \n" +
            "- Вожња једносмерном улицом у погрешном смеру. \n" +
            "- Прекорачење брзине у зони успореног саобраћаја за 11 до 30 км/х.\n" +
            "- Вожња у пешачкој зони\n" +
            "- Претицање непосредно испред, или на раскрсници\n" +
            "- Напуштање места удеса са мањом материјалном штетом пре доласка полиције\n" +
            "3 казнена поена (новчана казна од 6000 до 30 000 динара)\n" +
            "- Непоштовање права првенства пролаза на раскрсници. \n" +
            "- Превоз већег броја путника него што је уписано у саобраћајну дозволу или на местима која за \tто нису предвиђена. \n" +
            "- Поседовање радар-детектора. \n" +
            "- Прекорачење брзине ван насеља за 41 до 60 км/х. \n" +
            "- Кретање уназад на аутопуту и путу за моторна возила\n" +
            "4 казнена поена (новчана казна од 6000 до 30 000 динара)\n" +
            "- Вожња по магли без кратких и светала за маглу (уколико постоје) \n" +
            "- Прекорачење брзине у зони школе и зони „30“ за 31 до 50 км/х. \n" +
            "- Пресецање колоне пешака на коловозу.\n" +
            "- Прекорачење у зони успореног саобраћаја за 31 до 50 км/х. \n" +
            "- Управљање возилом оптерећеним преко дозвољене носивости или теретом који прелази \tдозвољене димензије. \n" +
            "5 казнених поена (новчана казна од 6 000 до 30 000 динара)\n" +
            "- Вожња са возачком дозволом која је истекла пре више од шест месеци. \n" +
            "- Вожња малолетног возача са пробном возачком дозоволом без надзора искусног возача \tкоји има најмање пет година возачку дозволу за ту категорију. \n" +
            "- Напуштање места незгоде пре увиђаја од стране полиције. \n" +
            "- Претицање са леве стране трамваја који се креће средином коловоза. \n" +
            "- Претицање са леве стране возила које очигледно скреће лево. \n" +
            "- Употреба мобилног телефона у вожњи. \n" +
            "- Неисправни пенуматици и уређаји за управљање. \n" +
            "6 казнених поена (новчана казна од 15 000 до 30 000 динара)\n" +
            "- Вожња са 0,5 до 1,20 промила алкохола у крви (средња алкохолисаност) \n" +
            "- Коришћење радар детектора. \n" +
            "- Пролазак кроз жуто и црвено светло. \n" +
            "- Превоз детета млађег од 12 година на сувозачком седишту. \n" +
            "- Прекорачење брзине ван насеља за 61 до 80 км/х. \n" +
            "- Претицање или обилажење са десне стране. \n" +
            "- Одбијање обављања техничког прегледа по наредби саобраћајног полицајца. \n" +
            "- Започињање претицања преко пуне линије уз прелазак у траку за супротни смер.\n" +
            "- Улазак и излазак са аутопута на недозвољеном месту. \n" +
            "- Прелазак преко пруге када је то забрањено. \n" +
            "- Прекорачење брзине у зони школе и зони ''30'' за 51 до 60 км/х.\n" +
            "7 казнених поена (новчана казна од 15 000 до 50 000 динара)\n" +
            "- Прекорачење брзине у насељу за 51 до 70 км/х. \n" +
            "- Непоштовање светлосних знакова који регулишу кретање у саобраћајним тракама. \n" +
            "8 казнених поена (новчана казна од 15 000 до 50 000 динара)\n" +
            "- Вожња под дејством психоактивних супстанци.\n" +
            "- Непоштовање наредби из полицијског возила. \n" +
            "10 казнених поена (новчана казна од 15 000 до 50 000 динара)\n" +
            "- Конзумирање алкохола или дрога пре увиђаја након саобраћајне несреће. \n" +
            "- Вожња са 1,2 до 1,6 промила алкохола у крви. \n" +
            "12 казнених поена (новчана казна од 15 000 до 50 000 динара)\n" +
            "- Вожња са 1,61 од 2,0 промила алохола у крви.\n" +
            "14 казнених поена (казна затвора од најмање 15 дана)\n" +
            "- Управљање возилом без одговарајуће дозволе.\n" +
            "- Вожња са више од 2,0 промила алкохола у крви. \n" +
            "- Одбијање алко-теста или теста на дрогу. \n" +
            "- Прекорачење брзине за више од 70 км/х у насељу, односно 80 км/х ван насеља. \n" +
            "- Прекорачење брзине за више од 50 км/х у зони успореног саобраћаја.\n" +
            "- Прекорачење брзине за више од 60 км/х у зони ''30'' и зони школе. \n" +
            "- Пролазак кроз црвено светло преко пешачког прелаза на којем се налази пешак. \n" +
            "15 казнених поена (казна затвора од најмање 30 дана)\n" +
            "- Саобраћајна несрећа изазвана насилничком вожњом.",R.drawable.cheese_1, null, "http://www.nesto.com");
    static CategoryObject o14 = new CategoryObject("Искључење возила из саобраћаја", "Од стране саобраћајног полицајца може бити искључено возило из саобраћаја: \n" +
            "- Возило које је оптерећено изнад дозвољене носивости за више од пет процената. \n" +
            "- Возило у пробној вожњи супротно условима датим у дозволи.\n" +
            "- Возило које супротно одредбама закона има уграђене уређаје за давање \tпосебних светлосних и звучних сигнала, а возач их не уклони у року који му је \tналожен. \n" +
            "- Возило које има непрописне регистарске таблице. \n" +
            "- Возило са технички неисправним системом управљања, односно заустављања, \tкао и при неисправности других уређаја и опреме које могу допринети \tугрожавању безбедности у саобраћају, односно животне средине. \n" +
            "- Возило које је регистровано у страној држави, а није осигурано у складу са \tпрописима Републике Србије. \n" +
            "- Возило које није евидентирано у јединствени регистар возила, или му је истекао рок важења регистрационе налепнице, односно потврде о коришћењу привремених \tтаблица.\n" +
            " - Возило којим се обавља недозвољена пробна вожња. \n" +
            " - Возило које је претходно искључено из саобраћаја за време трајања искључења. \n" +
            "- Возило које не испуњава услове у смислу прописаних димензија, највеће дозвољене укупне масе, односно осовинског оптерећења, као и возило које теретом премашује дозвољене димензије за одређене категорије возила, као и у случају непоседовања одговарајуће дозволе. \n" +
            "- Возило које не обавља ванредни превоз у складу са условима наведеним у одобрењу о ванредном превозу. \n" +
            "- Возило без потврде о хомологацији које је појединачно произведено или преправљено. \n" +
            "- Возило које није прошло технички преглед на који је упућено. \n" +
            "\n" +
            "Треба споменути да све трошкове смештаја путника, односно обезбеђења терета \tи возила носи власник, односно корисник возила које је искључено из саобраћаја.",R.drawable.cheese_1,null, "http://www.nesto.com");
    static CategoryObject o15 = new CategoryObject("Прекршаји санкционисани затворском казном", "Kazna od najmanje 15 dana (14 kaznenih poena)\n" +
            "- Upravljanje vozilom bez odgovarajuće dozvole\n" +
            "- Vožnja sa više od 2,0 promila alkohola u krvi. \n" +
            "- Odbijanje alko-testa ili testa na drogu. \n" +
            "- Prekoračenje brzine za više od 50 km/h u zoni usporenog saobraćaja.\n" +
            "- Prekoračenje brzine za više od 60 km/h u zoni ''30'' i zoni škole. \n" +
            "- Prolazak kroz crveno svetlo preko pešačkog prelaza na kome se nalazi pešak. \n" +
            "Kazna zatvora od najmanje 30 dana (15 kaznenih poena)\n" +
            "- Saobraćajna nesreća izazvana nasilničkom vožnjom.\n",R.drawable.cheese_1,null, "http://www.nesto.com");
    static CategoryObject o16 = new CategoryObject("Казне за угрожавање деце", "Посебна пажња је у новом Закону о безбедности у саобраћају обраћена на заштити деце. Самим тим су и казне за прекршаје који су учињени у присуству деце оштрије, и санкционишу се већим новчаним износом и додатним казненим поенима. Поред строжијих казни, одредбе закона предвиђају и едукацију у овом домену, што подразумева увођење додатних тема у наставни план и програм за децу предшколског узраста и основних школа. Максимална дозвољена брзина у околини школа је 30 км/х. \n" +
            "- Забрана вожње детета млађег од 12 година на предњем седишту, са новчаном казном од 5000 динара, а уколико је дете у крилу лица које седи на предњем седишту казна износи од 15 000 до 30 000 динара, и казна затвора до 30 дана. \n" +
            "- Вожња деце млађе од 12 година је забрањено и за возаче мотоцикала, трицикала и четвороцикала. Запрећена казна за овај прекршај је од 15 000 до 30 000 динара или до 30 дана затвора. \n" +
            "- Вожња брзином већом од 90 км/х у зони школе носи казну од најмање 15 дана затвора, 14 казнених поена, одузимање дозволе на осам месеци, а најмање 45 дана затвора, 16 казнених поена и забрана вожње на минимум 10 месеци уколико је изазвана саобраћајна несрећа. \n" +
            "- Вожња брзином од 81 до 90 км/х у зони школе доноси казну од 15 000 до 30 000 динара или 30 дана затвора и шест казнених поена, а три додатна казнена бода уколико је дошло до несреће. \n" +
            "- Вожња брзином од 61 до 80 км/х у зони школе доноси новчану казну од 6000 до 20 000 динара, одузимање дозволе на два месеца и четири казнена поена.",R.drawable.cheese_1, null, "http://www.nesto.com");
    static CategoryObject o17 = new CategoryObject("Искључење возача из саобраћаја",
            "Po odredbama Zakonus o bezbednosti u saobraćaju, saobraćajni policajac ima ovlašćenje da vozača privremeno isključi iz saobraćaja: \n" +
            "- Ukoliko je lice pod dejstvom opojnih droga (24 časa) \n" +
            "- Ukoliko lice insistira na analizi krvi odnosno urina (24 časa) \n" +
            "- Ukoliko lice odbija da se podrgne stručnom pregledu (24 časa) \n" +
            "- Ukoliko se lice nasilnički ponaša u saobraćaju (24 časa)\n" +
            "- Ukoliko je lice od dejstvom alkohola (24 časa), odnosno blago ili umereno \talkoholisano (12 \tčasova) \n" +
            "- Ukoliko lice ne poštuje ograničenja koja su mu određena (24 časa) \n" +
            "- Ukoliko lice prekorači vreme dozvoljenog trajanja upravljanja vozilom u toku 24 \tčasa \t(najviše 24 časa) \n" +
            "- Ukoliko lice ne poseduje dozvolu za kategoriju vozila kojim upravlja (isključenje \ttraje dok \ttraju razlozi isključenja) \n" +
            "- Ukoliko se utvrdi da lice upravlja vozilom za vreme trajanja isključenja \t(isključenje traje \tdok traju razlozi isključenja)\n" +
            "- Ukoliko lice koristi vozačku dozvolu druge države iz čijeg se sadržaja ne može \tutvrditi da li ima ostvareno pravo na upravljanje tim vozilom (isključenje \ttraje dok traju razlozi isključenja) \n" +
            "- Ukoliko lice upravlja vozilom za vreme trajanja zaštitne mere ili mere \tbezbednosti \t(isključenje traje dok traju razlozi isključenja).\n",R.drawable.cheese_1, null, "http://www.nesto.com");

    static Question cat2q1 = new Question("Желите да сазнате колика је казна за претицање или обилажење зауставном траком?", "Новчана казна: 6.000 - 20.000 динара (или казна затвора до 45 дана) Казнени поени: 2 (+ 1 у случају да је извршењем овог прекршаја проузрокована и саобраћајна незгода)");
    static Question cat2q2 = new Question("Желите да сазнате колика је казна за пешака који се креће и задржава на коловозу?", "Пешак не сме да се креће и задржава на коловозу, изузев у случајевима предвиђеним овим законом, као ни да изненада ступи на коловоз. Биће кажњен пешак уколико са собом води дете млађе од 12 година. Новчана казна: 6.000 - 20.000 динара (или казна затвора до 45 дана).");
    static Category twoCat2 = new Category("Неке од казни","Неке од казни" ,"Новчане казне од 6.000 до 20.000 динара предвиђене су за више од 100 прекршаја у Закону о безбедности саобраћаја на путевима новом закону, с тим што, ако је уз њих изазвана и непосредна опасност за другог учесника у саобраћају, или проузрокована саобраћајна незгода, односно прибављена себи или другом противправна имовинска или друга корист, казна ће бити од 10.000 до 40.000 динара или казна затвора до 45 дана.", Arrays.asList(o11, o12,o13,o14,o15,o16,o17), Arrays.asList(cat2q1, cat2q2), null);

    static Question o12q1 = new Question("Желите да сазнате да ли се сматрају путницима у јавном превозу лица која нису купила карту? ", "Путницима у јавном превозу, сматрају се лица која се налазе у превозном средству којим се обавља јавни превоз и која имају намеру да путују, без обзира да ли су купила возну карту или нису.");
    static Question o12q2 = new Question("Желите да сазнате ко одређује износ висине осигуране суме?", "Износ најниже осигуране суме на коју може бити уговорено осигурање путника у јавном превозу од последица несрећног случаја, по једном путнику утврђује Влада, на предлог Народне банке Србије.");
    static Category twoCat3 = new Category("Обавезно осигурање путника","Обавезно осигурање путника" ,"Власници превозних средстава којима се обавља јавни превоз путника дужни су да закључе уговор о осигурању путника у јавном превозу од последица несрећног случаја. ЗООС изричито предвиђа напред наведену обавезу за власнике:\n" +
            "1) аутобуса којим се обавља јавни превоз у градском, приградском, међуградском и међународном линијском и ванлинијском превозу,\n" +
            "2) аутобуса којим се обавља превоз запослених на посао и са посла,\n" +
            "3) аутобуса којим се обавља превоз деце и ученика до предшколских, односно школских установа и од предшколских, односно школских установа,\n" +
            "4) аутобуса за превоз туриста,\n" +
            "5) путничких аутомобила којима се обавља ауто-такси превоз и \"рент-а-кар\" возила,\n" +
            "6) шинских возила за превоз путника,\n" +
            "7) свих врста пловних објеката, којима се на редовним линијама или слободно превозе путници, укључујући и крстарења и превоз туриста,\n" +
            "8) свих врста \"рент-а-кар\" пловних објеката,\n" +
            "9) ваздухоплова чија је намена јавни авио-превоз (редовни, чартер, авио-такси),\n" +
            "10) туристичких ваздухоплова који се користе за краће прелете и панорамске летове и \"рент-а-кар\" ваздухоплова,\n" +
            "11) као и за власнике  других превозних средстава, без обзира на врсту погона, којима се превозе путници, уз наплату превоза, у виду регистроване делатности.", null, Arrays.asList(o12q1, o12q2), null);

    static Question o11q1 = new Question("Желите да сазнате да ли се Закон о обавезном осигурању у саобраћају односи на  превозна средства Војске Србије? ", "Закон о обавезном осигурању у саобраћају се не односи на превозна средства Војске Србије, већ се на питања у вези са  надокнадом штете произашле њиховом употребом примењују општа начела Закона о облигационим односима.");
    static Question o11q2 = new Question("Желите да сазнате како  Закон о обавезном осигурању у саобраћају дефинише појам  власника превозног средства?", "Закон о обавезном осигурању у саобраћају појам  власника превозног средства проширује и на кориснике истих, тј. правна или физичка лица која вољом власника користе превозно средство, као и на друга лица на које је регистровано неко од превозних средстава у складу са законом.");
    static Category twoCat4 = new Category("Накнада штете", "Накнада штете","Повећан ризик од проузроковања штете приликом употребе моторних возила у саобраћају определио је законодавца да на специфичан начин нормира правила о накнади штете у овој области.\n" +
            "\n" +
            "За разлику од општих правила о накнади штете, у области саобраћаја се поред одговорног лица-штетника појављује и друштво за осигурање са којим је исти закључио Уговор о обавезном осигурању, тако да оштећени свој захтев за накнаду штете може уперити и према њему било непосредно било уз утужење штетника.\n" +
            "\n" +
            "Закон о обавезном осигурању у саобраћају предвиђа обавезу власника превозних средстава да закључе Уговор о обавезном осигурању пре него што превозно средство ставе у саобраћај, о чему се издаје полиса која представља доказ о закљученом уговору и која се предаје органу који врши регистрацију. Услови осигурања су саставни део Уговора о обавезном осигурању и друштво за осигурање је дужно да их уручи уговорачу осигурања при закључењу Уговора, уз правило да ако су неке од његових одредби неповољније од овог закона  немају правно дејство. Обавеза друштва за осигурање из уговора о обавезно осигурању почиње по истеку двадесет четвртог часа од дана који је у полиси наведен као почетак осигурања а престаје по истеку двадесет четвртог часа од дана који је у полиси означен као дан истека трајања осигурања, ако није другачије уговорено. Напомињемо да је законодавац предвидео дужност корисника моторног возила да за време употребе моторног возила има код себе полису осигурања, као и да у случају саобраћајне незгоде са свим учесницима који имају право подношења одштетног захтева по овом Закону, да личне податке и податке о обавезном осигурању. \n" +
            "\n" +
            "Изричито су предвиђене следеће врсте обавезног осигурања у саобраћају, па тако:\n" +
            "а) обавезно осигурање путника у јавном превозу од последица несрећног случаја,\n" +
            "б) обавезно осигурање власника моторних возила од одговорности за штету причињену трећим лицима( тзв. осигурање од аутоодговорности),\n" +
            "в) обавезно осигурање власника ваздухоплова од одговорности за штету причињену трећим лицима и путницима,\n" +
            "г) обавезно осигурање власника чамаца од одговорности за штету причињену трећим лицима.",null,Arrays.asList(o11q1, o11q2), null);


    static CategoryObject o18 = new CategoryObject("Полицијски или европски записник", "Ако је дошло до лакше незгоде, где штета није велика и где учесници могу да установе и да се договоре о томе ко је изазвао незгоду, најбоље је попунити образац европског записника о незгоди. Записник треба попунити читко и са тачним подацима који се траже. Са тако попуњеним записником оштећени пријављује и потражује наплату штете код осигуравајуће куће која је осигурала возило које је изазвало незгоду. Треба имати у виду да осигуравајуће куће приликом снимања штете траже да се појави и возило које је изазвало незгоду да би се на основу оштећења утврдило да су та возила стварно учествовала у незгоди. Савет је да се контактира полиција, пријавави незгода, објасни да штета није велика и да нема повређених и тражити од њих савет да ли да се прави увиђај или да се иде на европски записник, јер ако дође до проблема може се доћи до евидентираног позива у полицији.\n" +
            "\n" +
            "Ако је штета велика и ако има повређених одмах се позовиа полиција, а они це позвати Хитну помоц уколико је потребно. Након што полиција обави увиђај, направиће записник са свим подацима (изјаве уцесника у незгоди, као и сведока уколико постоје, скицу са описом и фотографисање лица места). Записник је изузетно битан, пошто осигуравајућа кућа на основу њега исплаћује штету. Врло битно је да постоје сведоци, јер могу да буду од велике помоци на суду уколико дође до компликација у вези са утврђивањем кривице.\n" +
            "\n" +
            "Корисно је и забележити све податке о учесницима, полисама осигурања, регистарске бројеве аутомобила, пошто се може десити да неки податак буде погрешно уписан.\n" +
            "\n" +
            "Записник се подиже после десетак дана (понекад и дуже)  у Осигуравјућем друштву, мора се добро прочитати при преузимању и по потреби одмах уложити жалбу уколико се неке чињенице не слажу. Након преузмимања записника, мора се отићи у осигуравајућу кућу у којој је осигурано возило које је изазвало незгоду и поднети захтев за накнаду штете. Проценитељ осигуравајуће куће ће прегледати возило и извршити процену штете. Поправку може да обави неки од сервиса са којим осигуравајућа кућа има уговор или неки други сервис  који це по разумној цени поправити ауто.\n" +
            "\n" +
            "Постоји и могућност да се на лицу места потпише вансудско поравнање са осигуравајућом кућом и добије новац на рачун, стим што поправку возила, врши у сопственој режији, што наши возачи често прихватају, нарочито власници старијих аутомобила.\n" +
            "\n" +
            "Аутомобили у гарантном року се обавезно поправљају у овлашценим сервисима, што подразумева искључиво оригиналне делове, док се за возила ван гарантног рока или старија возила не морају користити оригинални делови, колико год то власник желео.",0, null, "http://www.nesto.com");
    static CategoryObject o19 = new CategoryObject("Каско осигурање", "Уколико се поседује каско осигурање, и не постоји кривица носиоца ове врсте осигурања, процедура пријаве и наплате штете се не разликује од већ описане. Уколико се жели убрзање процеса, то се врши преко осигуравајуће куће која је издала каско полису, која ће одмах, без полицијског записника, проценити штету и упутити аутомобил на поправку, а потом рефундирати трошкове од осигуравајуће куће код које је осигурано возило које је изазвало незгоду.\n" +
            "\n" +
            "Ако власник каско осигурања криви за штету другом учеснику у незгоди исту надокнађује обавезно осигурање, а за поправку возила може се искористити каско осигурање, уколико оно постоји. Процедура процене и исплате штете се не разликује. Ипак, уколико је реч о мањим оштећењима, често се не исплати пријавити штету, да се не би изгубио бонус за наредну годину или  добио малус.\n" +
            "\n" +
            "Када је у питању крађа возила иста се мора пријавити телефоном полицији, а затим отићи у локалну полицијску станицу како би се  направио записник.  Следи обавештавање осигуравајућој кући, али се захтев за исплату штете може поднети тек после месец дана (колико се чека на могућност да возило буде пронађено), и тада је потребно предати записник о пријави крађе полицији и доказ да ауто није пронађен, саобраћајну дозволу и кључеве. Проблем може направити недостатак саобраћајне дозволе или једног од кључева. Уколико аутомобил накнадно буде пронађен, аутоматски постаје власништво осигуравајуће куће, која га може продати или уступити претходном власнику уколико се тако договоре и овај врати исплаћену одштету.",0, null, "http://www.nesto.com");
    static CategoryObject o20 = new CategoryObject("Шта представља тотална штета возила", "Totalna šteta nastaje kada popravka vozila prevazilazi njegovu vrednost. U tom slučaju vrši se procena ostatka vozila u delovima, a njihova vrednost se oduzima od ukupnog iznosa odštete.",0,null, "http://www.nesto.com");
    static CategoryObject o21 = new CategoryObject("Када је у питању непознато или неосигурано возило", "Ако осигураник не поседује каско осигурање, а његово возило је ударило непознато возило, нико не надокнађује штету. Одштета се добија само у случају телесних повреда, а новац исплацује Гарантни фонд при Удружењу осигуравајућих организација. Ситуација је повољнија уколико је у питању нерегистровано возило, јер се у том случају може добити одштета преко Гарантног фонда.",0, null, "http://www.nesto.com");
    static CategoryObject o22 = new CategoryObject("Када је возило иностране регистрације", "При судару са возилом регистрованим у иностранству, обавезно се узма копија његове зелене карте да би се преписали сви податци са ње. Обавезан је и прибавити полицијски записник.  Затим преко неког од домаћих осигуравајућих друштава предаје одштетни захтев. Постоји и могућност да возило из иностранства нема зелену карту, већ  гранично осигурање, код домаћих осигуравајућих кућа. Тада се одштетни захтев подноси осигуравајућој кући која је издала полису граничног осигурања.",0, null, "http://www.nesto.com");
    static CategoryObject o23 = new CategoryObject("Када возилом управља лице под дејством алкохола и опојних средстава", "Sva prava na nadoknadu štete se gube ukoliko je vozilom upravljao vozač pod uticajem alkohola ili opojnih sredstava, ako nema dozvolu za određenu kategoriju, kao i ukoliko vozi pod zabranom.U tim slučajevima materijalnu odgovornost snosi vozač koji je izazvao nezgodu.",0, null, "http://www.nesto.com");
    static CategoryObject o24 = new CategoryObject("Када је возило на лизинг", "Lizing kuća je pravni vlasnik vozila, pa se njoj isplaćuje odšteta u slučaju totalne štete ili kradje. Lizing kuća od isplaćene sume uzima iznos jednak preostalim ratama, a ostatak daje korisniku lizinga. U slučaju da se ukradeni auto naknadno pronađe, postaje vlasništvo osiguravajuće kuće, a bivši vlasnik ga može preuzeti ako vrati isplaćenu odštetu. Situacija se ne razlikuje ni kod kredita ukoliko je potpisana vinkulirana polisa kasko osiguranja, pa se naknada isplaćuje banci, a dalja procedura je ista kao kod lizinga.",0, null, "http://www.nesto.com");
    static Category twoCat5 = new Category("Како наплатити штету", "Како наплатити штету","desc", Arrays.asList(o18, o19,o20,o21,o22,o23,o24), Arrays.asList(o1q1, o1q2), null);

    public static final CategoryContainer two = new CategoryContainer("Prekrsaji", Arrays.asList(twoCat1, twoCat2, twoCat3, twoCat4, twoCat5));

    static Question o25q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o25q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o25 = new CategoryObject("Превентивне мере у саобраћају", "...",0, Arrays.asList(o25q1, o25q2), "http://www.nesto.com");
    static Question o26q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o26q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o26= new CategoryObject("Посебна техничка средства за заштиту безбедности деце у саобраћају", "...",0, Arrays.asList(o26q1, o26q2), "http://www.nesto.com");
    static Question o27q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o27q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o27 = new CategoryObject("Школска саобраћајна патрола", "...",0, Arrays.asList(o27q1, o27q2), "http://www.nesto.com");
    static Question o28q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o28q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o28 = new CategoryObject("Техничка средства за успоравање саобраћаја", "...",0, Arrays.asList(o28q1, o28q2), "http://www.nesto.com");
    static Question o29q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o29q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o29 = new CategoryObject("Педибус", "...",0, Arrays.asList(o29q1, o29q2), "http://www.nesto.com");

    static Category threeCat1 = new Category("Безбедност деце", "Безбедност деце","desc", Arrays.asList(o25, o26, o27,o28,o29), Arrays.asList(o25q1, o25q2,o26q1, o26q2,o27q1, o27q2,o28q1, o28q2,o29q1, o29q2), null);

    static Question o30q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o30q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o30 = new CategoryObject("Развој бициклизма", "...",0, Arrays.asList(o30q1, o30q2), "http://www.nesto.com");
    static Question o31q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o31q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o31= new CategoryObject("Обележја безбедности бициклиста", "...",0, Arrays.asList(o31q1, o31q2), "http://www.nesto.com");
    static Question o32q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o32q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o32 = new CategoryObject("Базе података о саобраћајним незгодама бициклиста", "...",0, Arrays.asList(o32q1, o32q2), "http://www.nesto.com");
    static Question o33q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o33q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o33 = new CategoryObject("Урбани бициклисти", "...",0, Arrays.asList(o33q1, o33q2), "http://www.nesto.com");

    static Category threeCat2 = new Category("Бициклизам", "Бициклизам","desc", Arrays.asList(o30,o31,o32,o33), Arrays.asList(o30q1, o30q2,o31q1, o31q2,o32q1, o32q2,o33q1, o33q2), null);

    static Question o34q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o34q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o34 = new CategoryObject("Упоредна анализа", "...",0, Arrays.asList(o34q1, o34q2), "http://www.nesto.com");
    static Question o35q1 = new Question("Желите да сазнате у којој мери понашање утиче на безбедност у саобраћају? ", "Подаци говоре да понашање човека узрокује незгоде у преко 90% случајева. ");
    static Question o35q2 = new Question("Желите да сазнате о типовима личности чије црте указују на повећан ризик од удеса?", "Истраживања издвајају пет типова личности.");
    static CategoryObject o35= new CategoryObject("Црне тачке","...",0, Arrays.asList(o35q1, o35q2), "http://www.nesto.com");

    static Category threeCat3 = new Category("Анализе","Анализе" ,"desc", Arrays.asList(o34, o35), Arrays.asList(o34q1, o34q2,o35q1, o35q2), null);




    static Category threeCat4 = new Category("Занимљивости", "Занимљивости", "desc", Arrays.asList(o2, o3), Arrays.asList(o1q1, o1q2), null);
    static Category threeCat5 = new Category("Догађаји", null, "desc", Arrays.asList(o2, o3), Arrays.asList(o1q1, o1q2), null);

    public static final CategoryContainer three = new CategoryContainer("Aktivizam", Arrays.asList(threeCat1, threeCat2, threeCat3, threeCat4, threeCat5));

}
